; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s4-p7-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 
          c0 c1 c2 c3 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l1-0 l1-1 l1-2 l1-3 l2-0 l2-1 l2-2 l2-3 l3-0 l3-1 l3-2 l3-3 
          p0 p1 p2 p3 p4 p5 p6 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (at t0 l0-0)
    (at t1 l1-3)
    (at t2 l2-1)
    (at t3 l3-3)
    (at p0 l0-0)
    (at p1 l2-2)
    (at p2 l3-2)
    (at p3 l3-1)
    (at p4 l2-2)
    (at p5 l1-2)
    (at p6 l1-2)
    (at a0 l2-0)
    (at a1 l0-0)
    (at a2 l1-0)
)
(:goal
    (and
        (at p0 l3-0)
        (at p1 l0-0)
        (at p2 l0-3)
        (at p3 l0-2)
        (at p4 l3-2)
        (at p5 l2-3)
        (at p6 l3-2)
    )
)

  (:constraints
    (always (not (at p0 l0-1)))
  )
)

; plan
1. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 0 of 7
2. (drive-truck t3 l3-3 l3-2 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-2)
   goals met: 0 of 7
3. (drive-truck t2 l2-1 l2-3 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-3)
   goals met: 0 of 7
4. (drive-truck t1 l1-3 l1-2 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-2)
   goals met: 0 of 7
5. (fly-airplane a2 l1-0 l3-0)
   deleted: (at a2 l1-0)
   added: (at a2 l3-0)
   goals met: 0 of 7
6. (load-truck p2 t3 l3-2)
   deleted: (at p2 l3-2)
   added: (in p2 t3)
   goals met: 0 of 7
7. (load-truck p6 t1 l1-2)
   deleted: (at p6 l1-2)
   added: (in p6 t1)
   goals met: 0 of 7
8. (load-truck p5 t1 l1-2)
   deleted: (at p5 l1-2)
   added: (in p5 t1)
   goals met: 0 of 7
9. (drive-truck t2 l2-3 l2-2 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-2)
   goals met: 0 of 7
10. (fly-airplane a2 l3-0 l0-0)
   deleted: (at a2 l3-0)
   added: (at a2 l0-0)
   goals met: 0 of 7
11. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 0 of 7
12. (drive-truck t3 l3-2 l3-1 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-1)
   goals met: 0 of 7
13. (load-truck p4 t2 l2-2)
   deleted: (at p4 l2-2)
   added: (in p4 t2)
   goals met: 0 of 7
14. (load-truck p1 t2 l2-2)
   deleted: (at p1 l2-2)
   added: (in p1 t2)
   goals met: 0 of 7
15. (load-airplane p0 a2 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a2)
   goals met: 0 of 7
16. (load-truck p3 t3 l3-1)
   deleted: (at p3 l3-1)
   added: (in p3 t3)
   goals met: 0 of 7
17. (drive-truck t2 l2-2 l2-3 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-3)
   goals met: 0 of 7
18. (fly-airplane a2 l0-0 l3-0)
   deleted: (at a2 l0-0)
   added: (at a2 l3-0)
   goals met: 0 of 7
19. (drive-truck t3 l3-1 l3-2 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-2)
   goals met: 0 of 7
20. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 0 of 7
21. (unload-airplane p0 a2 l3-0)
   deleted: (in p0 a2)
   added: (at p0 l3-0)
   goals met: 1 of 7
22. (unload-truck p6 t1 l1-0)
   deleted: (in p6 t1)
   added: (at p6 l1-0)
   goals met: 1 of 7
23. (unload-truck p5 t1 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 1 of 7
24. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 1 of 7
25. (unload-truck p1 t2 l2-0)
   deleted: (in p1 t2)
   added: (at p1 l2-0)
   goals met: 1 of 7
26. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 1 of 7
27. (fly-airplane a2 l3-0 l1-0)
   deleted: (at a2 l3-0)
   added: (at a2 l1-0)
   goals met: 1 of 7
28. (load-airplane p4 a0 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a0)
   goals met: 1 of 7
29. (load-airplane p1 a0 l2-0)
   deleted: (at p1 l2-0)
   added: (in p1 a0)
   goals met: 1 of 7
30. (unload-truck p3 t3 l3-0)
   deleted: (in p3 t3)
   added: (at p3 l3-0)
   goals met: 1 of 7
31. (unload-truck p2 t3 l3-0)
   deleted: (in p2 t3)
   added: (at p2 l3-0)
   goals met: 1 of 7
32. (load-airplane p6 a2 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 a2)
   goals met: 1 of 7
33. (load-airplane p5 a2 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a2)
   goals met: 1 of 7
34. (fly-airplane a0 l2-0 l3-0)
   deleted: (at a0 l2-0)
   added: (at a0 l3-0)
   goals met: 1 of 7
35. (load-airplane p3 a1 l3-0)
   deleted: (at p3 l3-0)
   added: (in p3 a1)
   goals met: 1 of 7
36. (load-airplane p2 a1 l3-0)
   deleted: (at p2 l3-0)
   added: (in p2 a1)
   goals met: 1 of 7
37. (fly-airplane a2 l1-0 l3-0)
   deleted: (at a2 l1-0)
   added: (at a2 l3-0)
   goals met: 1 of 7
38. (unload-airplane p4 a0 l3-0)
   deleted: (in p4 a0)
   added: (at p4 l3-0)
   goals met: 1 of 7
39. (fly-airplane a1 l3-0 l0-0)
   deleted: (at a1 l3-0)
   added: (at a1 l0-0)
   goals met: 1 of 7
40. (unload-airplane p6 a2 l3-0)
   deleted: (in p6 a2)
   added: (at p6 l3-0)
   goals met: 1 of 7
41. (load-truck p4 t3 l3-0)
   deleted: (at p4 l3-0)
   added: (in p4 t3)
   goals met: 1 of 7
42. (fly-airplane a0 l3-0 l0-0)
   deleted: (at a0 l3-0)
   added: (at a0 l0-0)
   goals met: 1 of 7
43. (unload-airplane p3 a1 l0-0)
   deleted: (in p3 a1)
   added: (at p3 l0-0)
   goals met: 1 of 7
44. (unload-airplane p2 a1 l0-0)
   deleted: (in p2 a1)
   added: (at p2 l0-0)
   goals met: 1 of 7
45. (fly-airplane a2 l3-0 l2-0)
   deleted: (at a2 l3-0)
   added: (at a2 l2-0)
   goals met: 1 of 7
46. (load-truck p6 t3 l3-0)
   deleted: (at p6 l3-0)
   added: (in p6 t3)
   goals met: 1 of 7
47. (load-truck p3 t0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 1 of 7
48. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 1 of 7
49. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 1 of 7
50. (unload-airplane p5 a2 l2-0)
   deleted: (in p5 a2)
   added: (at p5 l2-0)
   goals met: 1 of 7
51. (unload-airplane p1 a0 l0-0)
   deleted: (in p1 a0)
   added: (at p1 l0-0)
   goals met: 2 of 7
52. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 2 of 7
53. (unload-truck p6 t3 l3-2)
   deleted: (in p6 t3)
   added: (at p6 l3-2)
   goals met: 3 of 7
54. (unload-truck p4 t3 l3-2)
   deleted: (in p4 t3)
   added: (at p4 l3-2)
   goals met: 4 of 7
55. (load-truck p5 t2 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 t2)
   goals met: 4 of 7
56. (unload-truck p2 t0 l0-3)
   deleted: (in p2 t0)
   added: (at p2 l0-3)
   goals met: 5 of 7
57. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 5 of 7
58. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 5 of 7
59. (unload-truck p5 t2 l2-3)
   deleted: (in p5 t2)
   added: (at p5 l2-3)
   goals met: 6 of 7
60. (unload-truck p3 t0 l0-2)
   deleted: (in p3 t0)
   added: (at p3 l0-2)
   goals met: 7 of 7
